Revit 2026 API

# VectorAtPoint Properties

---

The VectorAtPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ValueAtPointBase) |

#### Reference

VectorAtPoint Class

Autodesk.Revit.DB.Analysis Namespace